_protected/frontend/controllers/TugasAkhirController.php

SELECT MAX(updated_at) FROM `tugas_akhir`
---
    public function behaviors()
    {
        return [
            'httpCache' => [
                'class' => 'yii\filters\HttpCache',
                'only' => ['index'],
                'lastModified' => function ($action, $params) {
                    $q = new \yii\db\Query();
                    return strtotime($q->from('tugas_akhir')->max('updated_at'));

SELECT * FROM `tugas_akhir` WHERE `slug`='sistem-manajemen-beasiswa-berbasis-web-studi-kasus-smk-roudlotun-nasyiin-mojokerto'
---
    public function actionSlug($slug)
    {
        $journal_title = "PENS Final Project";
        $publisher = "Politeknik Elektronika Negeri Surabaya";

        $model = TugasAkhir::find()->where(['slug' => $slug])->one();